app/views/likes/_like.html.erb


  <% unless post.like_user(current_user.id).blank? %>
---
SELECT  1 AS one FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`post_id` = 10 LIMIT 1
SELECT `likes`.* FROM `likes` WHERE `likes`.`post_id` = 10

        <span class="grey-text text-darken-2">
          <%= post.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 10

        <span class="grey-text text-darken-2">
          <%= post.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 10


  <% if post.likes.count > 0 %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 10