app/views/users/show.html.erb

SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 ORDER BY `posts`.`created_at` DESC
---
  <div class="user_posts">
    <% @user.posts.each do |post| %>