app/views/posts/show.html.erb

  <div class="like_count">
    <%= @post.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 10