app/controllers/likes_controller.rb

SELECT  `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 AND `posts`.`id` = 10 ORDER BY `posts`.`created_at` DESC LIMIT 1
INSERT INTO `likes` (`post_id`, `user_id`, `created_at`, `updated_at`) VALUES (10, 1, '2019-09-09 01:40:26', '2019-09-09 01:40:26')
---
  def create
    @post = current_user.posts.find(params[:post_id])
    current_user.likes.create!(post_id: @post.id)

SELECT  `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 AND `posts`.`id` = 10 ORDER BY `posts`.`created_at` DESC LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 2
SELECT  `likes`.* FROM `likes` WHERE `likes`.`post_id` = 10 AND `likes`.`user_id` = 1 LIMIT 1
---
  def destroy
    @post = current_user.posts.find(params[:post_id])
    current_user.likes.find_by(post_id: @post.id).destroy!