app/controllers/posts_controller.rb

  def index
    @posts = Post.all.page(params[:page]).per(5)
---
SELECT  `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC, created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `posts`

  def create
    @post = Post.create(image: post_params[:image], text: post_params[:text], user_id: current_user.id)
---
INSERT INTO `posts` (`text`, `image`, `user_id`, `created_at`, `updated_at`) VALUES ('test3', 'france-confectionery-83373_960_720.jpg', 1, '2019-09-03 08:05:04', '2019-09-03 08:05:04')

  def show
    @post = Post.find(params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 10 ORDER BY `posts`.`created_at` DESC LIMIT 1

  def edit
    @post = Post.find(params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 9 ORDER BY `posts`.`created_at` DESC LIMIT 1

  def update
    @post = Post.find(params[:id])
    @post.update(update_params)
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 10 ORDER BY `posts`.`created_at` DESC LIMIT 1
UPDATE `posts` SET `text` = 'text. text. text. text. text. text. text. text. text. text. text. text. text. text. text. text. text. text. text. text. ?', `updated_at` = '2019-09-19 05:04:20' WHERE `posts`.`id` = 10