app/models/user.rb

  def already_liked?(post)
    self.likes.exists?(post_id: post.id)
---
SELECT  1 AS one FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`post_id` = 10 LIMIT 1